README.md
```mermaid
classDiagram
    class TypeEquipement {
        +String nom
    }
    class Equipement {
        +String numeroSerie
        +String description
        +EtatEquipement etat
    }
    class Affectation {
        +Date dateAffectation
        +Date dateRetour
        +String raisonRetour
        +String infoEquipement
    }
    class Signalement {
        +Date dateCreated
        +TypeSignalement type
        +String description
        +String infoEquipement
    }
    class Personnel {
        +String nom
        +String prenom
        +String email
        +String motDePasse
        +RolePersonnel role
    }
    class EtatEquipement {
        <<enumeration>>
        DISPONIBLE
        AFFECTE
        EN_PANNE
        REPARE
        HORS_SERVICE
    }
    class TypeSignalement {
        <<enumeration>>
        PANNE
        PROBLEME_FONCTIONNEL
        CASSE
        AUTRE
    }
    class RolePersonnel {
        <<enumeration>>
        ADMIN
        USER
    }

    TypeEquipement "1" --> "*" Equipement
    Equipement "0..1" --> "0..*" Affectation
    Personnel "1" --> "*" Affectation : reçoit
    Personnel "0..1" --> "*" Affectation : attribue
    Personnel "1" --> "*" Signalement : signale
    Equipement "0..1" --> "*" Signalement : concerne
    Equipement --> EtatEquipement
    Signalement --> TypeSignalement
    Personnel --> RolePersonnel
```
